# 数据类型在数据结构中的定义是一个值的集合以及定义在这个值集上的一组操作。白话讲就是给不同的对象进行分类。


# 广义概念的数据类型。在Python的世界，数据类型分两种，内置的和自定义的。


# 内置的包括数字、字符串、布尔、列表、元组、字典、Bytes、集合这些常用的以及一些不太常用的数据类型。
# 而自定义的，一般以类的形式，根据需要组合以上内置类型成为独特的数据类型。


# Python 中的变量不需要声明。每个变量在使用前都必须赋值，变量赋值以后该变量才会被创建。
# 在 Python 中，变量就是变量，它没有类型，我们所说的"类型"是变量所指的内存中对象的类型。

# 标准数据类型

"""  
Number（数字）
String（字符串）
bool（布尔类型）
List（列表）
Tuple（元组）
Set（集合）
Dictionary（字典）

"""
# Python3 的六个标准数据类型中：
# 不可变数据（3 个）：Number（数字）、String（字符串）、Tuple（元组）；
# 可变数据（3 个）：List（列表）、Dictionary（字典）、Set（集合）。
