# 1.提供一个数字参数，直接遍历数字：

for i in range(10):
    print(i)

""" 
只给一个数字类型参数，range会遍历从0到参数减1的数字
要特别注意，range默认从0开始，到参数减1，也就是左闭右开的规则，这也是Python很多地方的规则，比如切片

"""
print("==================================")
# 2.也可以指定遍历的区间：

for i in range(5, 12):
    print(i)

print("==================================")
# 3.还可以指定步长，就像切片一样
for i in range(1, 12, 2):
    print(i)

print("==================================")
# 4.但更多的时候是结合range和len函数，遍历一个序列的索引
a = ['Google', 'Baidu', 'Huawei', 'Taobao', 'QQ']
for i in range(len(a)):
    print(i, a[i]) 


print("==================================")
for i in range(10,1,-1):print(i)
"""  
如果你要用负数步长，那么你的区间设定就要从大到小；如果你的区间设定是从大到小，那么你就需要使用负数步长，这和列表的切片特性是一样样的。

"""